<script setup>
import { ref } from 'vue'
defineOptions({ name: 'MeAgreement' })

const message = `
焦点智家 App用户服务协议

请您务必认真阅读本焦点智家 App用户服务协议，本协议适用于您通过任何方式对焦点智家 App各项服务的访问和使用，使用焦点智家 App，即表示您同意通过电子方式确认本协议内容，同意受本协议约束。如果您或您的监护人不同意本协议的任何内容，您应该立即停止使用焦点智家 App服务。

本协议由广东焦点物联有限公司及其关联公司（以下合称为“焦点物联”）与您（若使用者为自然人）或您所代表的实体（若使用者为法人）（以下简称“ 您 ”）订立，约束您对焦点智家 App的使用。焦点物联特别提醒您在使用本服务之前认真阅读（未成年人应在法定监护人陪同下阅读）、充分理解本协议的全部条款，尤其是免责声明、投诉处理、管辖权等条款。除非您接受本协议的全部条款，否则您无权注册、登录或使用本服务。您的注册、登录、使用等行为将视为您对本协议的接受，并视为您同意接受本协议各项条款的约束。

您对本协议的接受包括接受焦点物联对本协议任何条款随时所做的任何修改。焦点物联有权随时修改本协议，更新后的协议将通过焦点物联官方网站、官方公众号或焦点智家 App等适当的方式进行公布。一旦公布即代替原协议条款，恕不单独通知每位用户，请用户自行在焦点物联官方网站、官方公众号或焦点智家 App内查阅最新版协议条款。如您不接受修改后的协议，请您立即停止使用本服务。您继续使用本服务将被视为您已接受了修改后的协议。

一、	名词定义
1.许可软件：是指由焦点物联开发的，供您从官网、官方公众号下载，并在限定的系统移动终端中安装、使用的软件系统。

2.服务：甶焦点物联为您提供的服务。您可以通过许可软件在移动终端使用服务。

二、	服务
焦点物联为您提供智能生活设备管理服务，您可以通过网关控制实现智能设备之间的联动。服务内容包含智能设备管理、场景联动、分析报告等，这些功能服务可能根据用户需求的变化或服务提供方的单方判断而优化或修改，也可能会因定期、不定期的维护而暂时停止提供服务。

三、	服务范围
1.您不得对本软件进行任何形式的许可、出售、租赁、转让、发行或其他商业用途。

2.您应理解许可软件仅可用于非商业目的，不可为商业运营目的安装、使用、运行许可软件。如果需要进行须提前获得焦点物联的书面授权和许可。

3. 焦点物联会对许可软件及其相关功能不时进行变更、升级或转移，可能会在许可软件系统中加入新的功能或服务。上述新功能、服务如无独立协议的，您仍可取得相应功能与服务的授权，适用本协议。

4.您应对输入数据的准确性、可靠性、完整性和合法性以及您获得数据的方式的合法性负责，并应定期备份数据、资料等。您对该资料等的损坏、丢失承担全部风险。

5.您应妥善保管您的账号、密码，如您发现您的账户存在安全隐患（包括但不限于用户密码泄露），应及时通知焦点物联，焦点物联将会协助您采取相关措施。否则，您账号下的一切行为均有您负责，并由您承担一切责任。

四、	第三方
1.您已知晓焦点物联的部分服务可能使用是基于第三方提供的软件或服务而获得，该服务是为了向您提供便利而设置，是取得该第三方的合法授权的。

2.本产品包含了第三方的部分信息和服务。焦点物联不控制且不对第三方的信息和服务负责。

3.您理解焦点物联无法保证许可软件将会永久地使用或包含该等服务，也无法保证将来是否继续使用相同第三方提供的其他软件，同时也可能使用其他第三方的类似服务，上述相应软件或服务一旦启用，同样适用本条约定。

五、	使用服务规范
1.您应该规范使用许可软件，以下方式是违反使用规范的：
a）发布或分享电脑病毒、蠕虫、恶意代码、故意破坏或改变计算机系统或数据的软件；
b）未授权的情況下，收集其他用户的信息或数据，例如电子邮箱地址等； 
c）用自动化的方式恶意使用本产品，绐服务器造成过度的负担或以其他方式干扰或损害服务器； 
d）在未授权的情况下，尝试访问本产品的服务器数据或通信数据； 
e）干扰、破坏本产品其他用户的使用。

2.您理解并同意： 
a) 焦点物联会对您是否涉嫌违反上述使用规范做出认定，并根据认定结果中止、终止对您的使用许可和（或）采取其他依约可采取的限制措施。 
b) 对于您使用许可软件时发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议的信息，焦点物联会直接予以删除。 
c) 对于您违反上述使用规范的行为对任意第三方造成损害的，您需要以自己的名义独立承担法律责任，并应确保焦点物联免于因此产生损失或增加费用，否则焦点物联有权向您追偿。 
d) 如您违反有关法律或者本协议之规定，使焦点物联遭受任何损失，您应当赔偿焦点物联因此造成的损失及（或）发生的费用。

六、	信息内容规范
1.您承诺不会利用本服务进行任何违法或不当的活动，包括但不限于上载、传送或分享含有下列内容之一信息的行为：
a) 反对宪法所确定的基本原则的； 
b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； 
c) 损害国家荣誉和利益的； 
d) 煽动民族仇恨、民族歧视、破坏民族团结的；
e) 破坏国家宗教政策，宣扬邪教和封建迷信的； 
f) 散布谣言，扰乱社会秩序，破坏社会稳定的； 
g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； 
h) 侮辱或者诽谤他人，侵害他人合法权利的； 
i) 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容； 
j) 含有适用法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。

七、	隐私政策与数据
保护您的个人信息对焦点物联很重要。焦点物联制定了《焦点智家 App隐私政策》对您的信息收集、使用、共享、存储、保护等方面关系内容进行了重要披露。建议您完整地阅读《焦点智家 App隐私政策》。

八、	免责条款
1.除法律法规有明确规定外，焦点物联将尽最大努力确保许可软件及其所涉及的技术及信息安全、有效、准确、可靠，但受限于现有技术，焦点物联不能对此进行担保。

2.您理解，对于不可抗力及第三方原因导致的您的直接或间接损失，焦点物联无法承担责任。

3.甶于您因下述任一情况所引起或与此有关的人身伤害或附带的、间接的损害赔偿需由您自行承担： 
a) 第三方未经批准的使用许可软件或更改您的数据； 
b) 使用许可软件进行的行为产生的费用及损失； 
c) 您对许可软件的误解； 
d) 非因焦点物联的原因而引起的与许可软件有关的其它损失。

4.非经焦点物联或焦点物联授权开发并正式发布的其它任何甶许可软件衍生的软件均属非法，下载、安装、使用此类软件，可能导致不可预知的风险，甶此产生的法律责任与纠纷与焦点物联无关，焦点物联有权中止、终止使用许可和（或）其他一切服务。

5.您已知悉使用焦点智家 App涉及到互联网服务，可能会受到各个环节不稳定因素的影响，尽管焦点物联已采取安全防卫措施，本服务仍可能因互联网和电子通信固有的缺陷以及本协议任何一方无法合理控制的时间（包括不限于火灾、洪水、恐怖袭击、瘟疫、自然灾害、暴乱、终端病毒、黑客攻击、网络故障、终端故障）而发生中止、中断、延误、使用限制或使用不能。您在此特意承担以上风险，同意因上述风险事件的实际发生影响到服务的正常运行时焦点物联无须向您承担任何责任。

九、	协议终止和违约责任
1.您应理解使用焦点物联服务需按授权范围使用许可软件、尊重软件及软件包含内容的知识产权、按规范使用软件、按本协议约定履行义务。如您严重违反本协议，焦点物联将终止使用许可。

2.您对软件的使用有赖于焦点物联及关联公司为您提供的配套服务，您若违反与焦点物联及关联公司的条款、协议、规则、通告等相关规定都可能导致您无法正常使用许可软件。焦点物联有权终止使用许可，或协议约定的方式对您的使用许可及其他焦点物联可控制的权益采取限制措施，包括中止或终止对您的使用许可。

3.一旦您违反本协议或与焦点物联签订的其他协议的约定，焦点物联可通知焦点物联关联公司，要求其对您的权益采取限制措施，包括要求关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的网站依法公示您的违约情况。

4.在本使用许可终止时，您应停止使用许可软件行为并销毁全部副本。

5.如您违反本协议规定的条款，给焦点物联或其他用户造成损失，您必须承担全部赔偿责任。

十、管辖法律和适用性
1. 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国大陆地区法律。

2. 因用户与焦点物联就本协议的签订、履行或解释发生争议，双方应努力友好协商解决。如协商不成，任何一方均有权向可提交本协议签订地有管辖权的法院诉讼解决。

附则

本协议自用户确认接受之时起或自用户的使用行为发生之时起（以时间在先者为准）生效。除非焦点物联或者用户根据本协议约定单方终止服务，或协商一致终止本协议，本协议长期有效。

广东焦点物联电气有限公司
2023年6月6日更新
`
</script>

<template>
  <div class="min-h-screen bg-white">
    <HeaderNavbar title="软件许可及服务协议" />
    <div class="p-4 mb-safe">
      <p class="whitespace-pre-wrap text-[#363636]">{{ message }}</p>
    </div>
  </div>
</template>
