<script setup>
import { ref } from 'vue'

defineOptions({ name: 'MeConceal' })

const message = `
焦点智家隐私政策

最近更新日期：2023年6月6日
生效日期：2023年1月1日

欢迎您使用焦点智家！我们非常重视您的隐私保护和个人信息保护。广东焦点物联有限公司及其关联公司（以下合称为“我们”）致力于保护您的个人隐私。
《焦点智家隐私政策》（下称“本政策“），本政策适用于您通过任何方式对焦点智家各项服务的访问和使用。当您在使用我们的服务时，我们会收集和处理您的相关信息，因此请您仔细阅读本政策并确定了解我们对您个人信息的收集和处理规则（包括如何收集、使用、保存、共享此类信息），以及为您提供访问、更新、删除和保护这些信息的方式。

此隐私政策旨在帮助您了解我们会收集哪些数据、为什么收集这些数据，会利用这些数据做些什么及如何保护这些数据。请您务必认真阅读本隐私政策，在确认充分了解并同意后使用焦点智家服务。使用我们的产品及服务，即表示您同意焦点智家隐私政策。如果您或您的监护人不同意本隐私政策的任何内容，您应该立即停止使用。在将您的信息用于本隐私权政策未涵盖的用途时，我们会事先征求您的同意。

请注意：当您通过焦点智家使用第三方产品和服务时，如果向该第三方提供您的个人信息，您的信息将适用该第三方的隐私政策。

请您确保您向我们提供的个人信息，以及您授权我们在本隐私政策所述范围内收集、处理、使用、存储、共享、转让或公开披露相关个人信息，不会侵犯他人合法权益。

本隐私政策将帮助您了解以下内容：

1. 我们如何收集和使用您的个人信息

2. 我们如何使用您的信息

3. 我们在何种情况下共享您的个人信息

4. 我们如何保存及保护您的个人信息

5. 您的选择与权利

6. 信息保留期限

7. 我们如何处理未成年人的个人信息

8. 隐私政策的更新

9. 如何联系我们

我们深知个人信息对您的重要性，也深知为您的信息提供有效保护是我们业务健康可持续发展的基石。感谢您对焦点智家的使用和信任！我们致力于维持您对我们的信任，恪守适用法律和我们对您的承诺，尽全力保证您的个人信息安全和合理使用。同时，我们郑重承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。

一、我们如何收集和使用您的个人信息

为了向您提供更好、更个性化的产品和服务，当您使用以下服务、功能或设置时，我们会以下列方式收集和使用您的个人信息：

1.您直接提供给我们的个人信息。
注册信息及资料信息。首次登录时，您需要提供您的手机号码来注册您的账号，并设置您的密码。如果您不提供信息，我们将无法为您创建账号并提供服务。当您注册成功后，在个人资料版块您可以选择性填写您的昵称和个性签名，在房屋选择和我的家人版块您可以选择性填写您的家庭信息，例如您的房屋名称、房屋地址、房屋图片、家人信息。您提供的家庭信息将有助于我们为您提供更优的智能体验（例如当您有多个房屋的时候，可以切换房屋后控制对应的房屋的智能设备）。如果您不提供这些信息则不会启用该功能，且不会影响您的基本功能使用。

2.我们通过您对焦点智家的使用收集的信息
a) 设备信息
您下载或使用我们的软件，或访问网页使用我们的服务时，我们可能会读取与您移动设备相关的信息，包括但不限于硬件型号、IMEI号码和其他唯一设备标识符、MAC地址、IP地址、操作系统版本以及用于访问服务的设备的设置；读取您使用的物联网电器的使用情况，包括但不限于设备型号、设备运行状态、设备使用频次、某些设备内置摄像头可能会拍摄设备的使用情况等。

b) 网络信息
当您的物联网设备首次联网或更换网络环境时，您需要进行设备配网流程。为了准确选取并配置WiFi网络，在配网过程中我们需要申请手机的位置权限以获取WiFi列表。同时配网过程会录取你的WiFi网络与密码，以完成设备配网。WiFi密码属于个人敏感信息，只在设备本地保存，不会上传至云服务器，我们不会收集WiFi密码。同时方便后续绑定设备，APP本地会加密保存WiFi密码，用于下次设备配网时密码自动填充，以便快速设备联网。

c) 日志信息
在您使用我们的产品与服务过程中，为识别帐号或设备的异常状态、了解或优化产品服务的适配性、提供应用程序版本升级或固件版本升级服务，我们会收集您的使用情况并存储为网络日志信息，包括相关设备的硬件型号、硬件唯一设备标识符、MAC地址、IP地址、操作系统版本、注册日期以及用于访问服务的设备的设置。为了提供更好的智能化体验服务，我们会收集您物联网设备的相关使用情况，例如设备型号、设备运行状态、设备使用频次、电量使用情况、环境温度、环境湿度。某些您绑定的设备内置摄像头与语音服务功能，在您使用相关功能时，我们会收集您与绑定物联网设备的图片相关信息。

d) 位置信息
当您开启设备或App定位功能并使用我们基于位置提供的相关服务时，我们会收集位置信息，以使得您不需要手动输入自身地理坐标就可获得相关服务。我们会使用IP 地址、GPS 以及能够提供相关信息的其他传感器（提供附近设备、WLAN接入点和基站的信息）等技术进行定位。您可以通过系统授权关闭定位功能，停止我们对您的地理位置信息的收集，关闭后您无法使用相关功能，或者无法达到相关服务拟达到的效果。注意：收集您当前所处的位置信息是为你提供环境服务和快捷的设备配网服务，并不会追踪您的行踪轨迹。

3. 为您提供安全保障
为提高您使用我们与我们的关联方、合作方提供的产品和服务的安全性，我们可能使用您的信息用于身份验证、客户服务、安全防范、诈骗监测、信贷分析等，以预防、发现、调查欺诈、危害安全、非法或违反与我们的协议、政策或规则的行为，以保护您、我们的其他用户、我们或我们的关联方、合作方及社会公众的合法权益。

4. 改善我们的产品和服务，开展内部审计、数据分析和研究
我们使用收集的信息来提供并改进我们及我们的关联方、合作方提供的产品和服务，并进行必要的业务运营，例如运营产品或提供服务，评估、维护和改进产品和服务的性能，开发新的产品和服务、提供客户支持等。

为改进我们及我们的关联方、合作方的产品和服务，我们也可能会对产品使用情况进行统计和分析。同时，我们可能会与公众共享这些统计信息，以展示我们服务的整体使用趋势，但这些统计信息将不会包含您的任何身份识别信息。

我们会将所收集到的信息用于大数据分析。例如，我们将收集到的信息用于分析形成不包含任何个人信息的统计类产品。我们可能对外公开并与我们的合作伙伴分享经统计加工后不含身份识别内容的大数据分析信息。

5.与收集和使用个人信息相关的其他事宜

事先征得授权同意的例外:
• 根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意；
• 与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公共知情等重大公共利益直接相关的；
• 与犯罪侦查、起诉、审批和判决执行等直接相关的；
• 出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；
• 所收集的个人信息是您自行向社会公众公开的；
• 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
• 根据您要求签订和履行合同所必需的；
• 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
• 为开展合法的新闻报道所必需的；
• 处于公共利益开展统计或学术研究所必要的，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
• 法律法规规定的其他情形。

6. 个人信息的匿名化处理
在收集到您的个人信息后，我们将通过技术手段及时对数据进行匿名化处理。在不泄露您个人信息的前提下，我们有权对匿名化处理后的用户数据库进行挖掘、分析和利用（包括商业性使用）。

7. 设备权限调用
焦点智家在提供服务过程中，经过您的授权会调用您的一些设备权限（包括但不限于定位、蓝牙、麦克风、相机、相册等）。您可以在设备的设置功能中选择关闭部分或全部权限，从而拒绝的焦点智家 App收集相应的个人信息。在不同设备中，权限显示方式及关闭方式可能有所不同，具体请参考设备及系统开发方说明或指引。特别地，对于焦点智家App的权限开启的方式和关闭方式如下：
设备权限	对应业务功能	调用权限目的	用户可否关闭权限

摄像头	二维码设备扫码更改上传头像或绑定网关、上传图片进行房屋设置、上传人脸信息	使用摄像头扫描设备二维码进行设备配网功能、更改个人信息、上传更新头像、设置房屋背景图片、上传对讲人脸识别图像	是
读取相册
(图片库)	上传图片更改头像、上传图片进行房间设置	直接选择手机内保存图片进行个人头像更改、设置房间背景图片等功能	是
读取手机SIM卡信息	业务功能	构建用户身份唯一识别码	是
读取位置信息	定位服务、添加设备	获取您的位置信息以便向您提供服务，包括天气服务、添加设备时用于发现附近WiFi或蓝牙列表	是
读写手机存储	插件更新；图片等信息存储；APP升级	APP与插件升级更新，同时会存储APP异常日志，便于分析定位问题	是
开启蓝牙	蓝牙设备配网	蓝牙配网和物联网蓝牙设备控制	是
读取通讯录	邀请家人	为实现邀请加入家庭组功能，安防报警指定通知联系人，需要开启该权限	是

4. 若您提供的信息中含有其他用户的个人信息，在向我们提供这些个人信息之前，您需确保您已经取得合法的授权。若我们要将信息用于本隐私政策未载明的其它用途时，会事先征求您的同意。若我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。

二、我们如何使用您的信息

我们会保持您的个人数据及时更新；安全地存储或销毁它；最小化收集和保留我们需要为您提供服务所需的数据；保护个人信息免遭泄露、滥用、未经授权的访问和披露；采取适当的技术措施保护您个人信息的安全。

我们将您的信息用于以下用途：
1.根据我们与您签订的合同向您提供服务（注册、家电激活与控制等）。
2. 按照我们收集信息时所述的要求提供其他您所要求的服务。
3. 维持我们储存和处理您个人信息的数据技术系统的完整性和安全性。
4. 执行或保护我们的协议或与您签订的合同。
5.检测和调查信息泄露、非法活动和欺诈行为。
6. 联系您解决问题。
7. 经过您许可的其他用途。

需要注意的是，以上使用方式涵盖了我们使用您信息的主要方式。我们可能时不时地通过更新App版本或设备固件等方式，为用户提供更加多样化的服务。当我们要将信息用于本协议未载明的其他用途时，或要将基于特定目的收集而来的信息用于其他目的时，会以签署协议、弹窗提示、更新本协议等形式再次征求您的同意。

三、我们在何种情况下共享您的个人信息

我们不会向第三方披露您的个人信息。但以下情况除外：
1.在法定情形下的共享
我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。

2.获取明确同意的情况下共享
获得您的明确同意后，我们会与第三方共享您的个人信息。

3.与关联公司间共享
为便于我们向您提供产品和服务，识别帐号异常，保护其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我们的关联公司和/或其指定的服务提供商共享。我们只会共享必要的个人信息，且受本协议中所声明目的的约束，如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。

4.与授权合作伙伴共享
我们可能委托授权合作伙伴为您提供某些服务或代表我们履行职能，我们仅会出于本协议声明的合法、正当、必要、特定、明确的目的共享您的信息，授权合作伙伴只能接触到其履行职责所需信息，且不得将此信息用于其他任何目的。此类处理后数据的使用和共享我们无需另行向您通知并征得您的同意。

四、我们如何保存及保护您的个人信息

1. 保存期限
您在使用焦点智家 App产品及服务期间，我们将持续为您保存您的个人信息。如果您注销帐户或主动删除上述信息，我们将依据网络安全法等法律法规规定保存您的信息。在您注销帐户或主动删除上述信息后，我们不会再对您的个人信息进行商业化使用，但我们可能会对您的个人信息进行匿名化处理后使用。

2. 安全措施
a）我们会以“最小化”原则收集、使用、存储和传输用户信息，并通过用户协议和隐私政策告知您相关信息的使用目的和范围。

b）我们非常重视信息安全。我们成立了专责团队负责研发和应用多种安全技术和程序等，我们会对安全管理负责人和关键安全岗位的人员进行安全背景审查，我们建立了完善的信息安全管理制度和内部安全事件处置机制等。我们会采取适当的符合业界标准的安全措施和技术手段存储和保护您的个人信息，以防止您的信息丢失、遭到被未经授权的访问、公开披露、使用、毁损、丢失或泄漏。我们会采取一切合理可行的措施，保护您的个人信息。我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击。

c）我们会对员工进行数据安全的意识培养和安全能力的培训和考核，加强员工对于保护个人信息重要性的认识。我们会对处理个人信息的员工进行身份认证及权限控制，并会与接触您个人信息的员工、合作伙伴签署保密协议，明确岗位职责及行为准则，确保只有授权人员才可访问个人信息。若有违反保密协议的行为，并会被追究相关法律责任。

d）我们提醒您注意，互联网并非绝对安全的环境，当您通过焦点智家 App中嵌入的第三方社交软件、电子邮件、短信等与其他用户交互您的个人信息时，不确定第三方软件对信息的传递是否完全加密，注意确保您个人信息的安全。

e）我们也请您理解，在互联网行业由于技术的限制和飞速发展以及可能存在的各种恶意攻击手段，即便我们竭尽所能加强安全措施，也不可能始终保证信息的百分之百安全。请您了解，您使用我们的产品和/或服务时所用的系统和通讯网络，有可能在我们控制之外的其他环节而出现安全问题。

五、您的选择与权利

按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
1.访问您的个人信息
您有权访问您的个人信息，法律法规规定的例外情况除外。您可以通过以下方式自行访问您的个人信息： 账户信息——如果您希望访问或编辑您的账户的绑定信息、更改您的密码、管理安全设备信息、进行账户关联、身份认证等，您可以进入【设置】执行此类操作。

2.更正您的个人信息
您发现我们处理的关于您的个人信息有错误时，您有权对错误或不完整的信息作出更正或更新，您可以通过info@acematic.net随时与我们联系。为保障安全，我们将在您行使更正权前对您的身份进行验证。

3.删除您的个人信息
在以下情形中，您可以向我们提出删除个人信息的请求，您可以通过info@acematic.net随时与我们联系：
a）如果我们违反法律法规或与您的约定收集、使用、与他人共享或转让您的个人信息；

b）如果我们违反法律法规规定或与您的约定，公开披露您的个人信息，您有权要求我们立即停止公开披露的行为，并发布通知要求相关接收方删除相应的信息。 当您从我们的服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。

c）如您想改变授权范围，您可通过我们的产品的隐私设置修改授权范围。 当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也将不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的同意或授权而开展的个人信息处理。

d）您随时可注销此前注册的账户。一旦您注销软件账号，将无法使用我们全线用户产品和服务，因此请您谨慎操作。我们为了保护您或他人的合法权益会结合您对我们各产品和服务的使用情况判断是否支持您的注销请求。

e）我们愿一直陪伴您，若因特殊原因导致我们的产品和服务被迫停止运营，我们将按照法律法规要求在App的主页面弹出具体公告或其他合适的能触达您的方式通知您，并将停止对您个人信息的收集，同时会按照法律规定对所持有的您的个人信息进行删除或匿名化处理等。

f）响应您的上述请求
为保障安全，您需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。 对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。

在以下情形中，按照法律法规要求，我们将无法响应您的上述请求：
• 与国家安全、国防安全直接相关的；
• 与公共安全、公共卫生、重大公共利益直接相关的；
• 与犯罪侦查、起诉、审判和执行判决等直接相关的；
• 我们有充分证据表明您存在主观恶意或滥用权利的（如您的请求将危害公共安全和其他人合法权益，或您的请求超出了一般技术手段和商业成本可覆盖的范围）；
• 响应个人信息主体的请求将导致您或其他个人、组织的合法权益受到严重损害的；
• 涉及商业秘密的。

六、信息保留期限
我们将在达成本政策所述目的或者法律法规要求的最短期限内处理您的个人信息，除非根据特定法律要求需要保留较长时间。我们将根据个人信息的数量、性质和敏感性决定适当的保留期限，在保留期限结束后，我们将销毁您的个人信息。

1.根据《用户协议》以及本政策以满足您请求的产品和服务；
2.当您明确要求删除您的个人信息时，我们将此设为任务并不再保留您的个人信息。
当我们在第1点的基础上确认个人信息完成收集和处理的目的，或在我们根据第2点确认您的删除或注销申请后，或我们终止运营相应产品或服务后，我们将停止保留，并对您的个人信息做删除处理。一般情况下，一旦达到规定的信息保留期限，我们将不会再保留您的个人信息。如果我们出于技术原因无法销毁信息，致使个人信息的保留超出存储期限，我们将采取适当措施防止您的个人信息被进一步使用，包括匿名化处理。

七、我们如何处理未成年人的个人信息

我们非常重视对未成年人信息的保护。我们的产品（含App）主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。

尽管当地法律和习俗对儿童的定义不同，但我们将不满 14 周岁的任何人均视为儿童。如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。

若您是未成年人，建议您请您的监护人仔细阅读本隐私政策，并在征得您的监护人同意的前提下使用我们的产品和服务或向我们提供信息。

如您的监护人不同意您按照本政策使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们，以便我们采取相应的措施。

如果监护人发现我们在未获监护人同意的时收集了未成年人的个人信息，请通过joinedlinks@126.com 联系我们，我们会设法尽快删除相关数据。

八、隐私政策的更新

我们可能适时修订本政策内容。对于会导致您在本政策项下权利的实质减损的重大变更，我们会于变更生效前在App的主页面弹出具体公告或其他合适的能触达您的方式通知您。若您不同意该等变更可以停止使用我们的产品和服务，若您继续使用我们的产品和服务，即表示您同意受修订后的本隐私政策的约束。

本政策所指的重大变更包括但不限于：
• 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
• 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
• 个人信息共享、转让或公开披露的主要对象发生变化；
• 您参与个人信息处理方面的权利及其行使方式发生重大变化；
• 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
• 个人信息安全影响评估报告表明存在高风险时。

九、如何联系我们

如果您对焦点智家 App及本隐私政策有任何意见或建议，您可以通过发送邮件至joinedlinks@126.com联系我们。

为保障我们高效处理您的问题并及时向您反馈，需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份处理您的请求。一般情况下，我们将在30天内回复。

如果您对我们的回复不满意，特别是您认为我们的个人信息处理行为损害了您的合法权益，您还可以通过向有管辖权的人民法院提起诉讼、向行业自律协会或政府相关管理机构投诉等外部途径进行解决。

再次感谢您对焦点智家 App的信任和使用！

`
</script>

<template>
  <div class="min-h-screen bg-white">
    <HeaderNavbar title="隐私政策" />
    <div class="p-4 mb-safe">
      <p class="whitespace-pre-wrap text-[#363636]">{{ message }}</p>
    </div>
  </div>
</template>
